//
//  Categories.swift
//  SuperCroco
//
//  Created by Alexey Davidenko on 24.04.2023.
//

import Foundation

struct Categories {
    
    let hobbieArray = ["Походы", "Кулинария", "Живопись", "Медитация", "Чтение", "Бег", "Йога", "Медитация", "Видеоигры", "Садоводство", "Вязание", "Плавание", "Сон", "Прогулки", "Стендап", "Фотография", "Оригами", "Паркур", "Гребля", "Стрельба"]
    
    let foodArray = ["Пицца", "Суши", "Стейк", "Паста", "Бургер", "Салат", "Рыба", "Мороженое", "Макароны", "Суп", "Картошка фри", "Первое блюдо", "Омлет", "Киндер-сюрприз", "Пирожок", "Торт", "Шаурма", "Хот-дог", "Сироп", "Сок"]
    
    let personsArray = ["Человек-паук", "Гарри Поттер", "Дэдпул", "Халк", "Лара Крофт", "Том Круз", "Джонни Депп", "Криштиану Роналду", "Месси", "Леонардо Ди Каприо", "Брюс Уиллис","Скарлетт Йоханссон", "Дженнифер Энистон", "Джеки Чан","Вандамм", "Мерлин Монро", "Одри Хепберн", "Кэрри Брэдшоу", "Том Харди", "Джон Сноу"]
    
    let animalsArray = ["Кошка", "Собака", "Крокодил", "Слон", "Тигр", "Кенгуру", "Пингвин", "Обезьяна", "Кит", "Волк", "Жираф", "Леопард", "Бегемот", "Белка", "Бобёр", "Буйвол", "Верблюд", "Гепард", "Выдра", "Горилла"]
    
    
}

