//
//Topic.swift
//  SuperCroco
//
//  Created by Келлер Дмитрий on 22.04.2023.
//

struct Topic {
    let category: Category
    let words: [String]
    let condition: String
    
    static func getTopics() -> [Topic] {
        return [
            Topic(
                category: .animal,
                words: ["кошка", "собака", "крокодил", "слон", "тигр", "кенгуру", "пингвин", "обезьяна", "кит", "волк", "жираф", "леопард", "бегемот", "белка", "бобр", "буйвол", "верблюд", "гепард", "выдра", "горилла"],
                condition: getRandomCondition()
            ),
            Topic(
                category: .food,
                words: ["пицца", "суши", "стейк", "паста", "бургер", "салат", "рыба", "мороженое", "макароны", "суп", "картошка фри", "первое блюдо", "омлет", "киндер-сюрприз", "пирожки", "торт", "шаурма", "хот-дог", "сироп", "сок"],
                condition: getRandomCondition()
            ),
            Topic(
                category: .person,
                words: ["Человек-паук", "Гарри Поттер", "Дэдпул", "Халк", "Лара Крофт", "Том Круз", "Джонни Депп", "Криштиану Роналду", "Месси", "Леонардо Ди Каприо", "Брюс Уиллис", "Скарлетт Йоханссон", "Дженнифер Энистон", "Джеки Чан", "Жан-Клод Вандамм", "Мерлин Монро", "Одри Хепберн", "Кэрри Брэдшоу", "Том Харди", "Джон Сноу"],
                condition: getRandomCondition()
            ),
            Topic(
                category: .hobby,
                words: ["фотография", "вязание", "вышивание", "видеоигры", "бег", "плавание", "танцы", "музыка", "кино", "книги", "живопись", "садоводство", "велосипед", "путешествия", "готовка", "вино", "пиво", "коньки", "лыжи", "парашютный спорт"],
                condition: getRandomCondition()
            )
        ]
    }
}

enum Category: String {
    case animal = "Животные"
    case person = "Личности"
    case food = "Еда"
    case hobby = "Хобби"
}

func getRandomCondition() -> String {
    let conditions = [
        "Объясни с помощью слов",
        "Объясни с помощью жестов",
        "Объясни с помощью рисунка",
        "Объясняй со злостью",
        "Объясняй с помощью мимики",
        "Объясняй вульгарно",
        "Объясняй сексуально"
    ]
    return conditions.randomElement() ?? ""
}



